Here is the relevant `plan` diff:

```
  # talos_machine_configuration_apply.control_planes["0"] will be created
  + resource "talos_machine_configuration_apply" "control_planes" {
      + apply_mode                  = "auto"
      + client_configuration        = (known after apply)
      + endpoint                    = "10.0.5.60"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.5.60"
    }

  # talos_machine_configuration_apply.control_planes["1"] will be created
  + resource "talos_machine_configuration_apply" "control_planes" {
      + apply_mode                  = "auto"
      + client_configuration        = (known after apply)
      + endpoint                    = "10.0.5.61"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.5.61"
    }

  # talos_machine_configuration_apply.control_planes["2"] will be created
  + resource "talos_machine_configuration_apply" "control_planes" {
      + apply_mode                  = "auto"
      + client_configuration        = (known after apply)
      + endpoint                    = "10.0.5.62"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.5.62"
    }

  # talos_machine_secrets.secrets will be created
  + resource "talos_machine_secrets" "secrets" {
      + client_configuration = (known after apply)
      + id                   = (known after apply)
      + machine_secrets      = (known after apply)
      + talos_version        = "v1.4"
    }

```